In [28]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [29]:
%sql postgresql://postgres:Nive1999@127.0.0.1/sparkifydb

In [30]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 2, 2, 31, 46, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 2, 2, 35, 52, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 2, 2, 38, 16, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 2, 2, 41, 13, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 2, 2, 47, 33, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"')]

In [31]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(3, 'Isaac', 'Valdez', 'M', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free'),
 (6, 'Cecilia', 'Owens', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (44, 'Aleena', 'Kirby', 'F', 'paid')]

In [32]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, Decimal('177.47546')),
 ('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179')),
 ('SOBZBAZ12A6D4F8742', 'Spanish Grease', 'AROUOZZ1187B9ABE51', 1997, Decimal('168.25424')),
 ('SOLLHMX12AB01846DC', 'The Emperor Falls', 'AR1Y2PT1187FB5B9CE', 0, Decimal('484.62322')),
 ('SOYTPEP12AB0180E7B', 'Twist and Shout', 'ARAJPHH1187FB5566A', 1964, Decimal('164.80608'))]

In [33]:
%sql SELECT count(*) FROM artists group by name;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
69 rows affected.

[(1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,),
 (1,)]

In [34]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 2, 2, 31, 46, 796000), 2, 2, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 2, 2, 35, 52, 796000), 2, 2, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 2, 2, 38, 16, 796000), 2, 2, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 2, 2, 41, 13, 796000), 2, 2, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 2, 2, 47, 33, 796000), 2, 2, 44, 11, 2018, 4)]

In [35]:
%sql SELECT COUNT(*) FROM songplays sp JOIN artists a on sp.artist_id = a.artist_id  WHERE a.name = 'Wayne Watson'

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[(0,)]

In [36]:
%sql SELECT TOP 5 u.*, SUM(s.duration) as total_time FROM songplays sp JOIN artists a on sp.artist_id = a.artist_id JOIN users u on sp.user_id = u.user_id GROUP BY u.user_id ORDER BY total_time DESC

 * postgresql://postgres:***@127.0.0.1/sparkifydb
(psycopg2.errors.SyntaxError) syntax error at or near "5"
LINE 1: SELECT TOP 5 u.*, SUM(s.duration) as total_time FROM songpla...
                   ^

[SQL: SELECT TOP 5 u.*, SUM(s.duration) as total_time FROM songplays sp JOIN artists a on sp.artist_id = a.artist_id JOIN users u on sp.user_id = u.user_id GROUP BY u.user_id ORDER BY total_time DESC]
(Background on this error at: https://sqlalche.me/e/20/f405)

Top 5 Songs which played most

In [41]:
%sql SELECT COUNT(DISTINCT sp.songplay_id) AS "TotalPlays", s.title FROM songplays AS sp JOIN songs AS s ON sp.song_id = s.song_id GROUP BY s.title ORDER BY "TotalPlays" DESC LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[(6, 'Setanta matins')]

Gender Breakdown of Users

In [43]:
%sql SELECT COUNT(user_id) AS "Total", gender FROM users GROUP BY gender ORDER BY "Total" DESC;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
2 rows affected.

[(55, 'F'), (41, 'M')]

To find out which free users listen to music the most. This can be used by the marketing team to make special offers to convert them to the premium plan.

In [44]:
%sql SELECT s.user_id, Count(*) AS songplays_count FROM   songplays AS s JOIN users AS u ON s.user_id = u.user_id WHERE  u.level = 'free' GROUP  BY s.user_id ORDER  BY songplays_count DESC LIMIT  10;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
10 rows affected.

[(26, 686),
 (32, 336),
 (101, 331),
 (50, 288),
 (86, 270),
 (66, 222),
 (37, 204),
 (69, 174),
 (10, 169),
 (8, 169)]

Find area with highest amount of listening instances:

In [45]:
%sql SELECT location, count(location) as num_of_listeners FROM songplays group by location order by num_of_listeners desc limit 1;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[('San Francisco-Oakland-Hayward, CA', 4146)]

Find amount of paying users:

In [47]:
%sql SELECT count(level) FROM users WHERE level = 'paid';

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[(22,)]